%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%      Memory      %%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%    Allocation    %%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

A_IQ_eff = nan(1,K); % Амплитуда квадратурных компонент, включая функцию sinc
I = nan(1,K);
Q = nan(1,K);
EpsPhi = nan(1, K); % Рассогласование по фазе (ист - экстр)
EpsW = nan(1, K);   % Рассогласование по частоте (ист - экстр)
Err_Phi = nan(1,K); % Ошибка по фазе
UdPLL = nan(1,K);   % Отсчеты дискриминатора в ФАП
