%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%      Memory      %%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%    Allocation    %%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

A_IQ_eff = nan(1,K); % Амплитуда квадратурных компонент, включая функцию sinc
I = nan(1,K);
Q = nan(1,K);
EpsPhi = nan(1, K); % Рассогласование по фазе (ист - экстр)
EpsW = nan(1, K);   % Рассогласование по частоте (ист - экстр)
Err_W_FLL = nan(1,K);    % Ошибка оценки частоты в системе ЧАП
Err_W_PLL = nan(1,K); % Ошибка оценки частоты в системе ФАП
Err_Phi_PLL = nan(1,K);
UdFLL = nan(1,K);      % Отсчеты дискриминатора в ЧАП
UdPLL = nan(1,K);     % Отсчеты дискриминатора в ФАП
