%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%      Memory      %%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%    Allocation    %%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

A_IQ = nan(1,K); % Амплитуда квадратурных компонент
A_IQ_eff = nan(1,K); % Онаже, включая функцию sinc
I = nan(1,K);
Q = nan(1,K);
EpsPhi = nan(1, K); % Рассогласование по фазе (ист - экстр)
EpsPhiP = nan(1,K); % Рассогласование по фазе в системе ФАП
EpsW = nan(1, K);   % Рассогласование по частоте (ист - экстр)
ErrW = nan(1,K);    % Ошибка оценки частоты в системе ЧАП
ErrWP = nan(1,K);   % Ошибка оценки частоты в системе ФАП
omega = nan(1,K);   % Вектор оценки частоты в системе ЧАП
omega_ist = nan(1,K); % Реальная частота
omegaP = nan(1,K);  % Оценка частоты в системе ФАП
phase = nan(1,K);   % ???
phase_ist = nan(1,K); % Реальная фаза
phaseP = nan(1,K);    % Оценка фазы в ФАП
Ud = nan(1,K);      % Отсчеты дискриминатора в ЧАП
UdP = nan(1,K);     % Отсчеты дискриминатора в ФАП